<?php


$x = @$_POST['x'];
$x0 = @$_POST['x0'];
$y0 = @$_POST['y0'];
$x1 = @$_POST['x1'];
$y1 = @$_POST['y1'];
$x2 = @$_POST['x2'];
$y2 = @$_POST['y2'];
$x3 = @$_POST['x3'];
$y3 = @$_POST['y3'];
$h = $x1-$x0;
$Δy0=$y1-$y0;
$Δy1=$y2-$y1;
$Δy2=$y3-$y2;
$Δny0=$Δy1-$Δy0;
$Δny1=$Δy2-$Δy1;
$Δmy0=$Δny1-$Δny0;
$Δmy1=($Δny1-$Δny0)/3;
$h1=$h *$h;
$r1= ($Δy1-$Δny1/2 + $Δmy1)?(1/$h)*($Δy1-$Δny1/2 + $Δmy1):0;
$r3 =($Δy0-$Δny0/2 + $Δmy0) ? (1/$h)*($Δy0-$Δny0/2 + $Δmy0):0;
if($h>0 || $h <0 ){
    $r5 = (1/$h)*($Δy2);
    $r11 = (1/$h) *(0);
    $u = ($x - $x0)/$h;
    $mm= (1/$h)*($Δy0+(2*$u-1)*$Δny0/2 + (3*$u*$u-6*$u+2)*$Δmy0/3);
}

if($h1>0 || $h1<0){
 $r6 =    (1/$h1)*( 0  ); 
$r4 = (1/$h1)*($Δny0  );

$r2 =(1/$h1)*($Δny1 - $Δmy0 );
$j= (1/$h1)*($Δny0 +($u-1)*$Δmy0/3 );

}



?>